In [8]:
import pandas as pd

In [13]:
df = pd.read_csv('H:\linear_regression\data\house_price_prediction_dataset.csv')

In [14]:
df.head()

,Area (sqft),BHK,Bathroom,Location,Parking,Furnishing,Price (in Lakhs)
0,1445,2,1,Mumbai,2,Semi-Furnished,103.25
1,1153,1,1,Mumbai,1,Semi-Furnished,91.65
2,1156,3,3,Pune,2,Unfurnished,124.80
3,1448,5,3,Delhi,0,Furnished,147.40
4,807,3,2,Pune,2,Furnished,94.35

In [16]:
df.drop(columns={'Location','Parking','Furnishing'},inplace=True)

In [17]:
df.head()

   Area (sqft)  BHK  Bathroom  Price (in Lakhs)
0         1445    2         1            103.25
1         1153    1         1             91.65
2         1156    3         3            124.80
3         1448    5         3            147.40
4          807    3         2             94.35

In [18]:
df.rename(columns={'Area (sqft)':'Area','Price (in Lakhs)':'Price'},inplace=True)

In [19]:
df.head()

   Area  BHK  Bathroom   Price
0  1445    2         1  103.25
1  1153    1         1   91.65
2  1156    3         3  124.80
3  1448    5         3  147.40
4   807    3         2   94.35

In [ ]:
### Notebook se ek level upara jane ke liye .. lagate he 

df.to_csv('../new_data/data.csv', index=False)